{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_first", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "filters": 30, "kernel_constraint": null, "name": "conv2d_1", "batch_input_shape": [null, 1, 28, 28], "dtype": "float32", "padding": "valid", "kernel_size": [5, 5], "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "filters": 15, "kernel_constraint": null, "data_format": "channels_first", "padding": "valid", "kernel_size": [5, 5], "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "units": 128, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "units": 5, "activation": "softmax", "kernel_regularizer": null}}], "backend": "theano", "keras_version": "2.0.2"}