{"config": [{"config": {"name": "conv2d_1", "data_format": "channels_first", "filters": 30, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "batch_input_shape": [null, 1, 28, 28], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "bias_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "data_format": "channels_first", "filters": 15, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "bias_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null, "units": 5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "backend": "theano", "class_name": "Sequential", "keras_version": "2.0.2"}